export const commonTextRu = (data) => {
    return <div>
        <h5>Что такое {data.channel_name}?</h5>
        <br/>
        <span>{data.channel_name} — это онлайн-сервис обмена виртуальных активов и фиатных валют. Наш сервис предназначен для быстрого и надёжного обмена криптовалюты в интернете. А также у нас есть услуга обмена криптовалюты на наличные.</span>
        <br/>
        <br/>
        <h5>Какие каналы обратной связи у Вас есть?</h5>
        <br/>
        <span>Чтобы связаться со службой поддержки Вы можете воспользоваться онлайн-чатом сервиса, написать в Telegram</span>
        <br/>
        <br/>
        <h5>Мне не хватает максимального лимита по моему направлению обмена. Как обменять суммы сверх лимита?</h5>
        <br/>
        <span>Если максимальная сумма обмена по направлению, которое Вас интересует, меньше необходимой, свяжитесь с оператором в Telegram, <a href={data.support_url}>({data.support_url})</a> чтобы согласовать обмен сверх лимита.</span>
        <br/>
        <br/>
        <h5>Какой график работы {data.channel_name}?</h5>
        <br/>
        <span>Пн – Пт: 10:00-19:00 (GMT+2); Сб: 10:00-16:00 (GMT+2);</span>
        <br/>
        <span>Вс: свободный график</span>
    </div>
}


export const changeTextRu = (data) => {
    return <div>
        <h5>Что делать, если у меня возникли сложности или ошибки в процессе обмена?</h5>
        <br/>
        <span>Если у Вас возникли какие-либо трудности или вопросы к процедуре обмена, свяжитесь с оператором поддержки используя  кнопку техподдержка. Наши операторы с удовольствием помогут Вам с решением любых вопросов, связанных с обменом на сервисе.</span>
        <br/>
        <br/>

        <h5>Что будет, если я отправлю сумму больше или меньше суммы указанной в заявке?</h5>
        <br/>
        <span>Сумма к получению рассчитывается в соответствии с фактической суммой оплаты. Если сумма, которая поступит на счет сервиса, будет отличаться от суммы к оплате в заявке, сумма к выплате будет пересчитана по курсу обмена на момент зачисления средств.</span>
        <br/>
        <br/>

        <h5>Оплатил заявку, но статус заявки не изменился. Что делать?</h5>
        <br/>
        <span>Заявка автоматически получает статус оплаченной, когда транзакция достигает определенного количества подтверждений в сети. Если статус Вашей заявки не изменился, дождитесь формирования транзакции и достижения необходимого количества подтверждений. Детальнее по ссылке.</span>
        <br/>
        <br/>

        <h5>После оплаты заметил, что ввел неверные реквизиты/допустил ошибку. Что делать?</h5>
        <br/>
        <span>Если Вы заметили ошибку в реквизитах после оплаты, немедленно свяжитесь с тех. поддержкой. Если заявка не была обработана сервисом, Вам помогут заменить реквизиты на актуальные. В случае, когда обработка заявки сервисом была завершена, а заявка получила статус выполненной, средства могут быть утеряны.</span>
        <br/>
        <br/>

        <h5>Могу я оплатить заявку несколькими транзакциями?</h5>
        <br/>
        <span>Для успешного обмена заявка должна оплачиваться одной транзакцией.</span>
        <br/>
        <br/>

        <h5>Как результаты AML-проверки могут повлиять на обмен?</h5>
        <br/>
        <span>Наш сервис придерживается международной политики AML/KYC. Все входящие транзакции проходят обязательную AML-проверку. В случае, если транзакция превышает допустимый уровень риска, она может быть заморожена платежной системой. В таком случае операция по обмену приостанавливается.</span>
        <br/>
        <br/>

        <h5>Хочу отменить заявку. Что делать?</h5>
        <br/>
        <span>Если Вы оплатили заявку, но приняли решение отменить операцию, возврат средств возможен только в случае, когда заявка не была обработана и выполнена сервисом. Если результирующая валюта была отправлена на счет пользователя, возврат не является возможным. Для отмены операции и возврата средств необходимо отправить соответствующий запрос на e-mail сервиса с контактных данных в заявке. Чтобы узнать детали свяжитесь с тех. поддержкой сервиса через кнопку техподдержка или в Telegram. <a href={data.support_url}>({data.support_url})</a></span>
        <br/>
        <br/>
    </div>
}


export const procedureTextRu = (data) => {
    return <div>
        <h5>Как происходит обмен Криптовалюты на Наличные?</h5>
        <br/>
        <span>Для обмена необходимо:
        <br/>
            • На главной странице сервиса, выбрать "Наличный обмен"
        <br/>
            • Выбрать поле Я хочу:  "Продать"  выбрать крипто валюту которую хотите обменять, 
        <br/>
            • Выбрать фиатную валюту, которую хотите получить. Заполнить все остальные поля. 
        <br/>
            • Нажать кнопку “Далее”. 
        <br/>
            • Проверить введенные данные. Нажать кнопку "Создать заявку" 
        <br/>
            • Получить уведомление в бот о созданной заявке.
        <br/>
            • Получить уведомление в бот заявка подтверждена
        <br/>
            • В боте нажать кнопку "Перейти к оплате” система автоматически переведет Вас на страницу оплаты заявки. Осуществить оплату на указанные системой реквизиты;
        <br/>
            • Когда заявка получит статус оплаченной, оператор сервиса свяжется с Вами по контактным данным указанным в заявке и предоставит инструкцию для получения наличных средств (только в рабочее время обменного пункта)
        </span>
        <br/>
        <br/>

        <h5>Как происходит обмен Наличные – Криптовалюта?</h5>
        <br/>
        <span>Для обмена необходимо:
        <br/>
            • На главной странице сервиса, выбрать "Наличный обмен"
        <br/>
            • Выбрать поле Я хочу:  "Купить"  выбрать крипто валюту которую хотите получить
        <br/>
            • Выбрать фиатную валюту, которую хотите отдать. Заполнить все остальные поля
        <br/>
            • Нажать кнопку “Далее”
        <br/>
            • Проверить введенные данные. Нажать кнопку "Создать заявку" 
        <br/>
            • Получить уведомление в бот о созданной заявке
        <br/>
            • Получить уведомление в бот заявка подтверждена
        <br/>
            • В боте нажать кнопку "Получить информацию ” система автоматически переведет Ваши данные и в бот Вы получите уведомление с адресом кассы кодом на внесение и остальные необходимые данные.
        <br/>
            • После внесения выбрать ордер и нажать кнопку "Я оплатил" 
        <br/>
            • Когда оператор сервиса подтвердит внесение заявка получит статус оплаченной
        <br/>
            • Ожидайте получение средств в установленное сервисом время на указанные Вами реквизиты
        <br/>
        </span>
        <br/>
        <br/>
    </div>
}



export const commonTextUa = (data) => {
    return <div>
        <h5>Що таке {data.channel_name}?</h5>
        <br/>
        <span>{data.channel_name} — це онлайн-сервіс обміну віртуальних активів і фіатних валют. Наш сервіс призначений для швидкого та надійного обміну криптовалюти в інтернеті. А також в нас є послуга обміну криптовалюти на готівку.</span>
        <br/>
        <br/>
        <h5>Які канали зворотнього звязку Ви маєте?</h5>
        <br/>
        <span>Щоб з'єднатись з службою підтримки, Ви можете скористатися онлайн-чатом сервісу, написати в Telegram</span>
        <br/>
        <br/>
        <h5>Мені не вистачає максимального ліміту по моєму направленні обміну. Як обміняти суми зверх ліміта?</h5>
        <br/>
        <span>Якщо максимальна сума обміну по направленню, яке Вас цікавить, менше необхідної, звяжітся з оператором в Telegram, <a href={data.support_url}>({data.support_url})</a> чтобы согласовать обмен сверх лимита.</span>
        <br/>
        <br/>
        <h5>Який графік роботи {data.channel_name}?</h5>
        <br/>
        <span>Пн – Пт: 10:00-19:00 (GMT+2); Сб: 10:00-16:00 (GMT+2);</span>
        <br/>
        <span>Нд: вільний графік</span>
    </div>
}



export const changeTextUa = (data) => {
    return <div>
        <h5>Що робити, якщо в мене з'явились складнощі або помилка в процесі обміну?</h5>
        <br/>
        <span>Якщо у Вас з'явились будь-які складнощі або питання до процедури обміну, зв'яжітся з оператором підтримки використовуючи  кнопку техпідтримки. Наші оператори з радістю допоможуть Вам з вирішенням будь-яких питань, зв'язаних з обміном на сервісі.</span>
        <br/>
        <br/>

        <h5>Що буде, якщо я відправлю суму більше або менше суми вказаної у заявці?</h5>
        <br/>
        <span>Сума до отримання розраховується у відношенні з фактичною сумою сплаты. Якщо сума, яка прийде на рахунок сервісу, буде відрізнятися від суми до сплати в заявці, сума до виплати буде перерахована по курсу обміну на момент зарахування коштів.</span>
        <br/>
        <br/>

        <h5>Сплатив заявку, але статус заявки не змінився. Що робити?</h5>
        <br/>
        <span>Заявка автоматично отримує статус сплаченої, коли транзакція досягає певної кількості підтверджень у мережі. Якщо статус Вашої заявки не змінився, дочекайтесь формування транзакції і досягнення необхідної кількості підтверджень. Детальніше по посиланню.</span>
        <br/>
        <br/>

        <h5>Після сплати замітив, що ввів не вірні реквізити/допустив помилку. Що робити?</h5>
        <br/>
        <span>Якщо Ви замітили помилку в реквізитах після сплати, негайно звяжіться з тех. підтримкою. Якщо заявка не була опрацьована сервісом, Вам допоможуть замінити реквізити на актуальні. У випадку, коли обробка заявки сервісом була завершена, а заявка отримала статус виконаної, кошти можуть бути втрачені.</span>
        <br/>
        <br/>

        <h5>Можу я сплатити заявку декільками транзакціями?</h5>
        <br/>
        <span>Для успішного обміну заявка повинна сплачуватись однією транзакцією.</span>
        <br/>
        <br/>

        <h5>Як результати AML-перевірки можуть вплинути на обмін?</h5>
        <br/>
        <span>Наш сервіс дотримується міжнародної політики AML/KYC. Всі вхідні транзакції проходять обовязкову AML-перевірку. У випадку, якщо транзакція перевищує допустимий рівень ризику, вона може бути заморожена платіжною системою. В такому випадку операція по обміну призупиняєтся.</span>
        <br/>
        <br/>

        <h5>Хочу відмінити заявку. Що робити?</h5>
        <br/>
        <span>Якщо Ви сплатили заявку, але прийняли рішення відмінити операцію, повернення коштів можливе тільки у випадку, коли заявка не була опрацьована і виконана сервісом. Якщо результуюча валюта була відправлена на рахунок користувача, повернення коштів не можливе. Для відміни операції і повернення коштів необхідно відправити відповідний запит на e-mail сервісу з контактними даними в заявці. Щоб дізнатись деталі звяжітся з тех. підтримкою сервісу через кнопку техпідтримки або в Telegram. <a href={data.support_url}>({data.support_url})</a></span>
        <br/>
        <br/>
    </div>
}


export const procedureTextUa = (data) => {
    return <div>
        <h5>Як відбувається обмін Криптовалюти на Готівку?</h5>
        <br/>
        <span>Для обміну необхідно:
        <br/>
            • На головній сторінці сервісу, вибрати "Готівковий обмін"
        <br/>
            • Вибрати поле Я хочу:  "Продати"  выбрати крипто валюту яку хочете обміняти, 
        <br/>
            • Выбрати фіатну валюту, яку хочете отримати. Заповнити всі інші рядки. 
        <br/>
            • Натиснути кнопку “Далі”. 
        <br/>
            • Перевірити введені дані. Натиснути кнопку "Створити заявку" 
        <br/>
            • Отримати повідомлення у бот по створеній заявці.
        <br/>
            • Отримати повідомлення у бот, що заявка підтверджена
        <br/>
            • В боті натиснути кнопку "Перейти до сплати” система автоматично переведе Вас на сторінку сплаты заявки. Виконати сплату на вказані системою реквізити;
        <br/>
            • Коли заявка отримає статус сплаченої, оператор сервісу звяжеться з Вами по контактним даним вказаних в заявці і надасть інструкцію для отримання готівкових коштів (тільки в робочий час обмінного пункту)
        </span>
        <br/>
        <br/>

        <h5>Як відбувається обмін Готівка – Криптовалюта?</h5>
        <br/>
        <span>Для обміну необхідно:
        <br/>
            •  На головній сторінці сервісу, вибрати "Готівковий обмін"
        <br/>
            • Выбрати поле Я хочу:  "Купити"  вибрати крипто валюту яку хочете отримати
        <br/>
            • Выбрати фіатну валюту, яку хочете віддати. Заповнити всі інші рядки
        <br/>
            • Натиснути кнопку “Далі”. 
        <br/>
            • Перевірити введені дані. Натиснути кнопку "Створити заявку" 
        <br/>
            • Отримати повідомлення у бот по створеній заявці.
        <br/>
            • Отримати повідомлення у бот, що заявка підтверджена
        <br/>
            • В боті натиснути кнопку "Отримати інформацію ” система автоматично переведе Ваші дані,і в бот Ви отримаєте повідомлення з адресою каси, кодом на внесення і інші необхідні дані.
        <br/>
            • Після внесення вибрати ордер и натиснути кнопку "Я сплатив" 
        <br/>
            • Коли оператор сервісу підтвердить внесення, заявка отримає статус сплаченої
        <br/>
            • Очікуйте отримання коштів в встановлений сервісом час, на вказані Вами реквізити
        <br/>
        </span>
        <br/>
        <br/>
    </div>
}